Tekla.Structures.ModelInternal.GraphicFace
Graphic object is a container for drawable object in Tekla Structures model view

Tekla.Structures.ModelInternal.GraphicFace.Polygon
Defines face position points in plane.

Tekla.Structures.ModelInternal.GraphicFace.Color
Defines color of the face.

Tekla.Structures.ModelInternal.GraphicFace.#ctor(Tekla.Structures.Model.Polygon,Tekla.Structures.Model.UI.Color)
Initializes a new instance of the Tekla.Structures.ModelInternal.GraphicFace class.
Default color is solid black.